podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM1_4CH_QDCTRL_MKE15Z7.svd.xml
            <register>
               <name>CONF</name>
               <description>Configuration</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>LDFQ</name>
                     <description>Frequency of the Reload Opportunities</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BDMMODE</name>
                     <description>Controls operation in BDM Mode\n
Selects the ratio between the number of counter overflows to the number of times the TOF bit is set</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Stopped, outputs functional</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Stopped, outputs forced to safe value</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Stopped, outputs frozen</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Functioning</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GTBEEN</name>
                     <description>External Global Time Base Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="GTBEEN" > <name>GTBEOUT</name> <description>Global Time Base Output</description> <bitOffset>10</bitOffset> </field>
                  <field>
                     <name>ITRIGR</name>
                     <description>Initialization trigger on Reload Point</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>On counter wrap events</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>When reload point is reached</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTPOL</name>
               <description>FTM Fault Input Polarity</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>FLTPOL</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Fault Input Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT0POL</name>
                     <description>Fault Input 0 Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Active high\tA one at the fault input indicates a fault</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active low\tA zero at the fault input indicates a fault</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FLT0POL" > <name>FLT1POL</name> <description>Fault Input 1 Polarity</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FLT0POL" > <name>FLT2POL</name> <description>Fault Input 2 Polarity</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FLT0POL" > <name>FLT3POL</name> <description>Fault Input 3 Polarity</description> <bitOffset>3</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SYNCONF</name>
               <description>Synchronization Configuration</description>
               <addressOffset>0x8C</addressOffset>
               <fields>
                  <field>
                     <name>HWTRIGMODE</name>
                     <description>Hardware Trigger Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TRIGj cleared when trigger j detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TRIGj unaffected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTINC</name>
                     <description>CNTIN Register Synchronization with buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Updated on rising edges of system clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Updated by PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CNTINC" > <name>INVC</name> <description>INVCTRL Register Synchronization with buffer</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CNTINC" > <name>SWOC</name> <description>SWOCTRL Register Synchronization with buffer</description> <bitOffset>5</bitOffset> </field>
                  <field>
                     <name>SYNCMODE</name>
                     <description>Synchronization Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Legacy PWM synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enhanced PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWRSTCNT</name>
                     <description>FTM counter synchronization is activated by the software trigger</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The software trigger does not activate the FTM counter synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The software trigger activates the FTM counter synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWWRBUF</name>
                     <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by the software trigger</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The software trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The software trigger activates MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWOM</name>
                     <description>Output mask synchronization is activated by the software trigger</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The software trigger does not activate the OUTMASK register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The software trigger activates the OUTMASK register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWINVC</name>
                     <description>Inverting control synchronization is activated by the software trigger</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The software trigger does not activate the INVCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The software trigger activates the INVCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWSOC</name>
                     <description>Software output control synchronization is activated by the software trigger</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The software trigger does not activate the SWOCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The software trigger activates the SWOCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWRSTCNT</name>
                     <description>FTM counter synchronization is activated by a hardware trigger</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A hardware trigger does not activate the FTM counter synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A hardware trigger activates the FTM counter synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWWRBUF</name>
                     <description>MOD, HCR, CNTIN, and CV registers synchronization is activated by a hardware trigger</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A hardware trigger does not activate MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A hardware trigger activates MOD, HCR, CNTIN, and CV registers synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWOM</name>
                     <description>Output mask synchronization is activated by a hardware trigger</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A hardware trigger does not activate the OUTMASK register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A hardware trigger activates the OUTMASK register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWINVC</name>
                     <description>Inverting control synchronization is activated by a hardware trigger</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A hardware trigger does not activate the INVCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A hardware trigger activates the INVCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HWSOC</name>
                     <description>Software output control synchronization is activated by a hardware trigger</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A hardware trigger does not activate the SWOCTRL register synchronization</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A hardware trigger activates the SWOCTRL register synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INVCTRL</name>
               <description>FTM Inverting Control</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>INVEN</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Paired Channels Inverting Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>INV0EN</name>
                     <description>Pair Channels 0 Inverting Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not inverted</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Inverted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="INV0EN" > <name>INV1EN</name> <description>Pair Channels 1 Inverting Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="INV0EN" > <name>INV2EN</name> <description>Pair Channels 2 Inverting Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="INV0EN" > <name>INV3EN</name> <description>Pair Channels 3 Inverting Enable</description> <bitOffset>3</bitOffset> </field>
               </fields>
            </register>
