podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM1_4CH_QDCTRL_MKE15Z7.svd.xml
            <register>
               <name>SWOCTRL</name>
               <description>FTM Software Output Control</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>CHOC</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Channel Software Output Control Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CH0OC</name>
                     <description>Channel 0 Software Output Control Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OC" > <name>CH1OC</name> <description>Channel 1 Software Output Control Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH2OC</name> <description>Channel 2 Software Output Control Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH3OC</name> <description>Channel 3 Software Output Control Enable</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>CHOCV</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Channel Software Output Control Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CH0OCV</name>
                     <description>Channel 0 Software Output Control Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Forces 0 to output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Forces 1 to output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OCV" > <name>CH1OCV</name> <description>Channel 1 Software Output Control Value</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH2OCV</name> <description>Channel 2 Software Output Control Value</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH3OCV</name> <description>Channel 3 Software Output Control Value</description> <bitOffset>11</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PWMLOAD</name>
               <description>FTM PWM Load</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>CHSEL</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Channel Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CH0SEL</name>
                     <description>Channel 0 Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not include channel in the matching process</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Include channel in the matching process</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0SEL" > <name>CH1SEL</name> <description>Channel 1 Select</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH2SEL</name> <description>Channel 2 Select</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH3SEL</name> <description>Channel 3 Select</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>HCSEL</name>
                     <description>Half Cycle Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Half cycle reload is disabled and it is not considered as a reload opportunity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Half cycle reload is enabled and it is considered as a reload opportunity</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LDOK</name>
                     <description>Load Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Loading updated values is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Loading updated values is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLEN</name>
                     <description>Global Load Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Global Load Ok disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Global Load OK enabled. A pulse event on the module global load input sets the LDOK bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLDOK</name>
                     <description>Global Load OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>LDOK bit is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCR</name>
               <description>Half Cycle Register</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>HCVAL</name>
                     <description>Half Cycle Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD_MIRROR</name>
               <description>Mirror of Modulo Value</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>FRACMOD</name>
                     <description>Modulo Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>MOD</name>
                     <description>Mirror of the Modulo Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C0V_MIRROR</name>
               <description>Mirror of Channel Match Value</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>FRACVAL</name>
                     <description>Channel Match Fractional Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>VAL</name>
                     <description>Mirror of the Channel Match Integer Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="C0V_MIRROR"> <name>C1V_MIRROR</name> <addressOffset>0x208</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C2V_MIRROR</name> <addressOffset>0x20C</addressOffset> </register>
            <register derivedFrom="C0V_MIRROR"> <name>C3V_MIRROR</name> <addressOffset>0x210</addressOffset> </register>
         </registers>
      </peripheral>
